---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.LineLoadAllZero
source: html/504773c9-6c19-2d7a-6178-616f6ed8a880.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.LineLoadAllZero Property

Line Load can't have all force components and moment components to be zero.

## Syntax (C#)
```csharp
public static FailureDefinitionId LineLoadAllZero { get; }
```